app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(schoolclasses_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-11-07 08:04:50.516848"], ["updated_at", "2017-11-07 08:04:50.516848"]]